In [3]:
import pandas as pd 
import numpy as np

In [6]:
students_performance = pd.read_csv('StudentsPerformance.csv')
students_performance = students_performance.rename(columns={
'parental level of education':'parental_level_of_education',
'test preparation course':'test_preparation_course',
'math score':'math_score',
'reading score':'reading_score',
'writing score':'writing_score'
})

In [26]:
students_performance.groupby(['gender', 'race/ethnicity'], as_index=False).aggregate({'math_score':'mean', 'reading_score':'mean'}).rename(columns = {
    'math_score' : 'mean_math_score',
    'reading_score' : 'mean_reading_score'
})

   gender race/ethnicity  mean_math_score  mean_reading_score
0  female        group A        58.527778           69.000000
1  female        group B        61.403846           71.076923
2  female        group C        62.033333           71.944444
3  female        group D        65.248062           74.046512
4  female        group E        70.811594           75.840580
5    male        group A        63.735849           61.735849
6    male        group B        65.930233           62.848837
7    male        group C        67.611511           65.424460
8    male        group D        69.413534           66.135338
9    male        group E        76.746479           70.295775

In [24]:
mean_scores = students_performance.groupby(['gender', 'race/ethnicity']).aggregate({'math_score':'mean', 'reading_score':'mean'}).rename(columns = {
    'math_score' : 'mean_math_score',
    'reading_score' : 'mean_reading_score'
})

In [23]:
mean_scores.loc[[('female', 'group A'), ('female','group B')]]

                       mean_math_score  mean_reading_score
gender race/ethnicity
female group A               58.527778           69.000000
       group B               61.403846           71.076923

In [28]:
students_performance.math_score.nunique()

81

In [30]:
students_performance.groupby(['gender', 'race/ethnicity']).math_score.nunique()

gender  race/ethnicity
female  group A           29
        group B           51
        group C           59
        group D           53
        group E           44
male    group A           38
        group B           43
        group C           56
        group D           49
        group E           38
Name: math_score, dtype: int64

In [38]:
students_performance.sort_values(['gender','math_score'],ascending=False).groupby('gender').head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90

In [39]:
 students_performance['total_score'] = students_performance.math_score+students_performance.reading_score+students_performance.writing_score

In [40]:
students_performance

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282
996,male,group C,high school,free/reduced,none,62,55,55,172
997,female,group C,high school,free/reduced,completed,59,71,65,195
998,female,group D,some college,standard,completed,68,78,77,223
999,female,group D,some college,free/reduced,none,77,86,86,249

In [45]:
students_performance = students_performance.assign(total_score_log = np.log(students_performance.total_score), total_score_mean = np.mean(students_performance.total_score))

In [46]:
students_performance

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,total_score_log,total_score_mean
0,female,group B,bachelor's degree,standard,none,72,72,74,218,5.384495,203.312
1,female,group C,some college,standard,completed,69,90,88,247,5.509388,203.312
2,female,group B,master's degree,standard,none,90,95,93,278,5.627621,203.312
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,4.997212,203.312
4,male,group C,some college,standard,none,76,78,75,229,5.433722,203.312
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282,5.641907,203.312
996,male,group C,high school,free/reduced,none,62,55,55,172,5.147494,203.312
997,female,group C,high school,free/reduced,completed,59,71,65,195,5.273000,203.312
998,female,group D,some college,standard,completed,68,78,77,223,5.407172,203.312
999,female,group D,some college,free/reduced,none,77,86,86,249,5.517453,203.312

In [47]:
students_performance.drop(['total_score_mean'], axis=1)

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,total_score_log
0,female,group B,bachelor's degree,standard,none,72,72,74,218,5.384495
1,female,group C,some college,standard,completed,69,90,88,247,5.509388
2,female,group B,master's degree,standard,none,90,95,93,278,5.627621
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,4.997212
4,male,group C,some college,standard,none,76,78,75,229,5.433722
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282,5.641907
996,male,group C,high school,free/reduced,none,62,55,55,172,5.147494
997,female,group C,high school,free/reduced,completed,59,71,65,195,5.273000
998,female,group D,some college,standard,completed,68,78,77,223,5.407172
999,female,group D,some college,free/reduced,none,77,86,86,249,5.517453

In [48]:
dota_heroes = pd.read_csv('dota_hero_stats.csv')

In [119]:
dota_heroes.groupby('legs').aggregate({'legs':'count'})

      legs
legs
0       11
2       95
4        7
6        3
8        1

In [74]:
dota_heroes.query("localized_name == 'Phoenix'")

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
108,108,Ranged,110,2,Phoenix,npc_dota_hero_phoenix,str,"['Support', 'Nuker', 'Initiator', 'Escape', 'D..."

In [70]:
accountancy = pd.read_csv('accountancy.csv')

In [117]:
accountancy.groupby(['Type','Executor']).aggregate({'Salary':'mean'})

                   Salary
Type Executor
A    Loopa      58.000000
     Pupa      160.833333
B    Loopa     145.166667
     Pupa       77.000000
C    Loopa     154.333333
     Pupa       74.500000
D    Loopa     137.714286
     Pupa      146.500000
E    Loopa     164.000000
     Pupa      131.200000
F    Loopa     238.000000
     Pupa      136.250000

In [83]:
dota_heroes.groupby(['attack_type', 'primary_attr']).aggregate({'attack_type' : 'count', 'primary_attr' : 'count'})

                          attack_type  primary_attr
attack_type primary_attr
Melee       agi                    19            19
            int                     2             2
            str                    35            35
Ranged      agi                    18            18
            int                    40            40
            str                     3             3

In [4]:
concentrations = pd.read_csv('algae.csv')

In [87]:
concentrations

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886
5,Cladophora_compacta,Cladophora,green,5.712284,3.461692,3.082826,3.343707,1.432514
6,Cladophora_gracilis,Cladophora,green,2.452623,6.881024,5.841520,2.740165,2.829016
7,Palmaria_palmata,Palmaria,red,0.704580,3.176440,5.573905,3.242090,2.245538
8,Saccharina_latissima,Saccharina,brown,1.636122,5.793163,1.071920,3.947968,4.817804
9,Ascophyllum_nodosum,Ascophyllum,brown,6.825467,0.875429,5.253527,3.414961,2.432526

In [90]:
mean_concentrations = concentrations.groupby('genus', as_index=False).aggregate({'sucrose':'mean', 'alanin':'mean', 'citrate':'mean', 'glucose':'mean', 'oleic_acid':'mean'})

In [115]:
concentrations.query("genus == 'Fucus'").alanin.describe()

count    3.000000
mean     3.566411
std      3.149943
min      0.346431
25%      2.028965
50%      3.711498
75%      5.176401
max      6.641303
Name: alanin, dtype: float64

In [111]:
rgb_vodrosli = concentrations.query("(group == 'brown') | (group == 'green') | (group == 'red')").groupby('group')

In [112]:
rgb_vodrosli.aggregate({'sucrose':lambda x : max(x) - min(x)})

        sucrose
group
brown  5.189345
green  3.259662
red    0.000000

In [113]:
rgb_vodrosli.aggregate({'citrate':'std'})

        citrate
group
brown  2.338577
green  1.987489
red         NaN

In [114]:
rgb_vodrosli.aggregate({'species':'count'})

       species
group
brown        6
green        3
red          1

In [5]:
concentrations.aggregate({'species':'count'})

species    10
dtype: int64